In [10]:
import pandas as pd
df = pd.DataFrame({"gruplar1": ["A","B","C","A","B","C"],
                  "degisken1": [10,23,33,22,11,99],
                  "degisken2": [100,253,333,262,11,969]},
                 columns = ["gruplar1","degisken1","degisken2"])
df

  gruplar1  degisken1  degisken2
0        A         10        100
1        B         23        253
2        C         33        333
3        A         22        262
4        B         11         11
5        C         99        969

In [11]:
def filter_func(x) :
    return x["degisken1"].std() >9

In [14]:
df.groupby("gruplar1").std()

          degisken1   degisken2
gruplar1
A          8.485281  114.551299
B          8.485281  171.119841
C         46.669048  449.719913

In [13]:
df.groupby("gruplar1").filter(filter_func)

  gruplar1  degisken1  degisken2
2        C         33        333
5        C         99        969